<?php
$num = 1;
while($num <= 100) {
    echo $num."<br>";
    $num++;
}

echo "<br>";

// IT用語 SESに向けて準備しよう
echo "IT用語 SESに向けて準備しよう<br>";
echo "1. サブクエリ：クエリの中の一つの要素として、さらにクエリを入れたもの。<br>";
echo "データベースなどの問い合わせ（クエリ）文の内部に含まれる、別の問い合わせ文のこと。<br>";
echo "2. Bootstrap：HTML／CSS／JavaScriptから構成される最も有名なWEBフレームワーク。<br>";
echo "これを使うことでデザイン性が高く、レスポンシブ対応したWEBサイトを知識がなくても作成できるメリットがある。<br>";
echo "3. ライブラリ・フレームワーク<br>";
echo "・ライブラリ：プログラム言語において、ある特定の機能を持つプログラムを定型化して、<br>";
echo "他のプログラムが引用できる状態にしたものを、複数集めてまとめたファイルのこと。<br>";
echo "・フレームワーク：アプリケーションを開発するとき、その土台として機能させるソフトウェアのこと。<br>";
echo "土台となるフレームワークに必要な機能を追加し、アプリケーションの開発を進めていくのが一般的。<br>";
?>