<?php
//2017年12月31日 23時59分59秒をタイムスタンプに変換。
//echo strtotime("2017/12/31 23:59:59");
echo date("Y年m月d日 H時i分s秒", "1514764799");
?>

<p>IT用語 SESに向けて準備しよう</p>
<p>1. ログ（意味、確認の仕方）</p>
<p>・意味：コンピュータの利用状況やデータ通信など履歴や情報の記録を取る事、またその記録。</p>
<p>・確認の仕方：メニューバー「JECTOR」>「ログを表示…」をクリックする。</p>
<p>2. クラウドサーバー、レンタルサーバー、VPSの違い</p>
<p>・クラウドサーバー：クラウド環境に作られたサーバーのこと。</p>
<p>・レンタルサーバー：サーバーを貸し出すサービスのこと。</p>
<p>共用サーバーは１台のサーバーを複数のユーザーで共有して使うサービス、</p>
<p>専用サーバーは特定のユーザーが1台のサーバーを専有して利用できるサービス、</p>
<p>・VPS（仮想専用）は１台のサーバーの中で契約者ごとに領域を区切りあたかも1つのサーバーのように設定されて（仮想化されて）提供されるもの</p>
<p>3. PHPのFWの種類と特徴</p>
<p>・CakePHP：日本語に翻訳された優れたチュートリアルがあり、エラーメッセージが親切なため習得が早い。</p>
<p>パッケージをFTPでアップロードするだけで動作するため設置が簡単。</p>
<p>・CodeIgniter：「高速」「軽量」「シンプル」「低い学習コスト」「高い自由度」などの特徴により、開発しやすく扱いやすい</p>
<p>・FuelPHP：比較的に新しく作られたPHPフレームワーク。規約よりも設定を重視しているため高度なアプリケーション開発に向いている</p>
<p>・Laravel：CakePHP同様にWeb開発に必要な機能が一式揃えられており、コマンドが他のフレームワークに比べ豊富で追加することも簡単。</p>
<p>実装はとても簡単で、コードが分かりやすいため習得までが早い。</p>