<?php
$x = 0;

// $x = $x + 5;
$x += 5;
echo $x;

// 改行
echo '<br>';

// $x = $x * 5;
$x *= 5;
echo $x;

// 改行
echo '<br>';

//IT用語
echo "1. エビデンス：最終検証段階においてシステムが発注どおりに動作していることを示す<br>";
echo "証拠となる書類やデータなどのこと<br>";
echo "2. バッチ：複数のプログラムからなる作業において、あらかじめ一連の手順を登録しておき、<br>";
echo "まとめて連続的に実行する方式。<br>";
echo "3. MVCモデル：Model View Controller。<br>";
echo "プログラムの中身を「モデル（Model）」「ビュー（View）」「コントローラ（Controller）」の3つに分類しておくこと。<br>";
echo "・Model：システム内のビジネスロジックを担当。システムの設計や機能をどうするかがここで行われる。<br>";
echo "・View：実際に表示したり、入力する機能の処理を行う。<br>";
echo "・Controller：ユーザーの入力に基づきモデルとビューを制御する役割。<br>";
?>