<?php
$my_name = $_POST['my_name'];
$email = $_POST['email'];
$password = $_POST['password'];
?>
<p>私の名前は、<?php echo $my_name; ?></p>
<p>私のメールアドレスは、<?php echo $email; ?></p>
<p>私のパスワードは、<?php echo $password; ?></p>

<!--IT用語 SESに向けて準備しよう-->
<p>IT用語 SESに向けて準備しよう</p>
<p>1. 仕様書・設計書：仕様書は、こう有るべきという仕様（決め事）を記載する書類のこと。</p>
<p> 設計書は、その仕様を実現する為に「どのようなシステム構成にするか？」「どうやって作るか？」という実現方法を記載した書類のこと。</p>
<p>2. Git：オープンソースの分散バージョン管理システムの一つ。 </p>
<p>複数の開発者が共同で一つのソフトウェアを開発する際などに、</p>
<p>ソースコードやドキュメントなどの編集履歴を統一的に管理するのに用いられる。</p>
<p>3. マージツール：複数のファイルやデータ、プログラムなどを、決められたルールに従って一つに統合すること。</p>